wendylabsinc/wendy-lite/sdkconfig.defaults.esp32c61
# Target: ESP32-C61 (single-chip Wi-Fi 6 + BLE 5 board, RISC-V, no 802.15.4).
# Mirrors the C6 overlay; the firmware-side knobs we care about are the same
# shape: 4 MB flash, classic WAMR, native Wi-Fi + BT.
CONFIG_IDF_TARGET="esp32c61"

# Flash size - keep at 4 MB; partitions.csv is sized accordingly.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table - custom CSV with single WASM slot
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WAMR: classic interp + mini loader keep flash/RAM use tight on the C61.
CONFIG_WAMR_INTERP_CLASSIC=y
# CONFIG_WAMR_INTERP_FAST is not set
CONFIG_WAMR_INTERP_LOADER_MINI=y
# CONFIG_WAMR_INTERP_LOADER_NORMAL is not set

# Move WiFi/PHY hot paths from IRAM to flash (frees ~15-25 KB DIRAM)
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n
CONFIG_ESP_PHY_IRAM_OPT=n
